["*14th Floor, Open Floor Plan w/ Hardwood Floors &amp; Balcony \n*24/7 Door Man \n*Dishwasher, Comcast, AC, Heat &amp; Exercise Room Included \n*Red Line/LaSalle Street Buses Across Street \n*Starbucks, Soul Cycle, Happy Camper, Plum Market, Aldi &amp; Je ...", "Awesome Renovated 1Bed Garden In Medical District/UIC/West Loop \nLarge Living Room \nHardwood Style Laminate Flooring \nTile Bathroom \nBedroom Fits Kingsize \nBar Kitchen \nCall Colin *** \nKale Realty \n2447 N Ashland Ave", "HUGE Hardwood 2Bed. \nSunny Front Windows \nGiant Living Room. \nFull Dining Room \nUpdated Kitchen With Tons Of Cabinets \nBig Bedrooms \nPrivate Back Patio \nGORGEOUS Well-Managed Walk-Up \nLaundry on-site \nEasy access to shopping and Restaraunts \nPerfect  ...", "Rent $750.0 /month electricity and water is included Cta Bus And Train is same corner for downtown walking distance for Jackson Park Hospital good for stuudents call or text *** Syed", "Luxury Optima Towers 2 BDRM FURNISHED in Downtown Evanston Northwestern University! \nAvailable for rent is a Furnished 2 bedroom 2 bathroom Optima Towers Luxury condo unit conveniently located in Downtown Evanston. \nLocated in the heart of Evanston,  ...", "Lovely ranch style town home. 2 bedroom and 2 bathroom, vaulted ceilings, skylights, and open concept is what you will find in this home. Kitchen has pantry, breakfast bar, stainless steel appliance package included. Master En-suite with walk in clos ...", "Lovely ranch style town home. 2 bedroom and 2 bathroom, vaulted ceilings, skylights, and open concept is what you will find in this home. Kitchen has pantry, breakfast bar, stainless steel appliance package included. Master En-suite with walk in clos ...", "1 bedroom rehab condominium for rent with gorgeous lake view and heat included in price \nExtra storage \nElevator building \nDirectly across from lake \n24- hour doorman and fitness room. \nWalk to the lake and park. \nBus express to downtown and other st ...", "Adorable and over-sized condo unit, newly renovated! Great 2 bedroom and 2 full bath rooms condo (end unit and 3rd floor) in Harbor Cove Condominiums. Beautiful eat-in kitchen with stainless steel appliances and gorgeous cabinets. Striking hardwood f ...", "Roomy eat-in kitchen with island, great room (with dining room and area for home office), large double door bedroom closets. \nGreat Location! Three blocks from the Westmont train station. 2-flat in quiet neighborhood setting. \nRecently renovated, cen ...", "XL 2017 Gut Rehab available Sept 1. Unique and spacious one bedroom overlooking one of the most coveted Gold Coast streets. High ceilings, refinished hardwood floors, faux fireplace. Amazing new kitchen with recessed lighting, new 42' cabinets, new s ...", "PROPERTY INFO \nID: 48642943 Beds: 0 Bath: 1 Available Date: - Pet: Pet Friendly \nPrice shown is net effective of current promotion. \nI'd love to help you with your search! Please answer these questions and we can get started: \nWhat's your ideal move  ...", "Lakeview \n3 Bed, 1 Bath \n1415 W. Henderson \nAvailable: 9/1/2020 \n$2100 per Month \nNaji *** \nIdeal unit in the heart of the Southport Corridor, three bedroom, one bathroom walkup features central heat and air, large living and dining rooms, updated ki ...", "SEE VIDEO (copy and paste the YouTube link into your browser): https://youtu.be/2H47Xa9NrzE \n5042 N. Wolcott, 2nd floor \nSuper nice 1 bedroom + office for rent in Ravenswood! This is a 2nd floor unit in a walk-up building at Wolcott and Winnemac. Onl ...", "SEE VIDEO (copy and paste the YouTube link into your browser): https://youtu.be/5JYW66xjRkk \n*** CONCESSION: The 2nd month's rent is FREE!!! *** \n3546 N. Bosworth \nBeautiful 5 bedroom / 3 bathroom apartment for rent in Lakeview! This is a high 1st fl ...", "River West \n1 Bed, 1 Bath \n1473 W. Erie \nAvailable: 8/1/2020 \n$1500 per Month \nNaji *** \nRiver West one bedroom plus den, vintage rehab features over 800 SF, A/C, new hardwood floors throughout, updated kitchen appliances, dishwasher, ceramic tiled b ...", "This beautiful 3 bed/2bath apartment has a private stairwell, featuring an entry closet with plenty of storage room. The living room has vaulted ceilings with 2 skylights that amplify the amazing amount of natural sunlight you’ll have at any given  ...", "Roscoe Village \n2 Bed, 3 Bath \n1940 W. Diversey \nAvailable: Now \n$2700 per Month \nNaji *** \nAwesome two bedroom plus loft, three bathroom in Roscoe Village with stunning layout features updated kitchen with dishwasher, spacious living area, cathedral ...", "Available for August 1st is a beautiful 2 bedroom apartment in Little Village. Conveniently located between bustling Cermak and 26th Street, and short walk to the Kedzie Pink Line Station. \nWarm vintage feel, giant 19th century sized windows provide  ...", "Roscoe Village \n2 Bed, 2 Bath \n1940 W. Diversey \nAvailable: 8/1/2020 \n$2175 per Month \nNaji *** \nTerrific two bedroom, two bathroom condo quality in Roscoe Village walkup features new kitchen, dishwasher, built-in microwave, hardwood floors, large, l ...", "Ukrainian Village \n2 Bed, 1 Bath \n2644 W. Walton \nAvailable: 8/1/2020 \n$1200 per Month \nNaji *** \nPhenomenal garden unit in Ukrainian Village features heat, electric, water, and gas included, newer eat in kitchen, large combination living and dining  ...", "Mid-Century 1 Bedroom rehab Listing ID #: 1209 Address: 7241 N CLAREMONT, #4a Price: $1,295 Property Type: Apartment Bedrooms: 1.0 Bathrooms: 1.0 Pets: Cats Only Apartment Amenities Dishwasher Eat In Kitchen Granite Kitchen Hardwood Complete luxury r ...", "FANTASTIC HIGHLY DESIRABLE LOCATION! \nWEBSTER &amp; DAMEN \nNO PETS \nON SITE LAUNDRY (AND A LAUNDROMAT IS ONLY 2 BLOCKS AWAY). \nFIRST FLOOR UNIT \nTONS OF SUN EXPOSURE \nHARDWOOD FLOORS \nCENTRAL HEAT \nHUGE CEILINGS \nOPEN FLOOR PLAN \nTHIS IS A $1200 UNIT ...", "Contact info: RIVER WEST 3 BR 1 BATH BRIGHT + CLEAN 1460 W Erie St #2, Chicago, IL 60642 $2200/mo KEY FEATURES Year Built: 1885 Sq Footage: 1200 sqft. Bedrooms: 3 Beds Bathrooms: 2 FULL Bath Parking: None Lease Duration: 1 Year Deposit: $600 Pets Pol ...", "Lincoln Park \nStudio, 1 Bath \n550 W. Arlington \nAvailable: Now \n$1350 per Month \nNaji *** \nGorgeous Lincoln Park studio features cooking gas included, updated kitchen, new bathroom, high ceilings, great closet space, spacious living area, hardwood fl ...", "Full amenity building in the South Loop. Check it out today. Cats &amp; dogs ok. Garage parking extra. Building offers: Aqua lounge Fitness &amp; spin studio Pet Spa Jam room Game room Units offer: Hardwood Floors Stainless steel appliances Floor to  ...", "LARGE STUDIO CONDO, south facing with a great view of the city. \nALL UTILITIES INCLUDED (gas, water, heat and central air, electricity, wifi, cable/DVR). \nIt is available for move in on August 1st. Move in date is flexible. \nThe condo is a large stud ...", "Lakeview \nStudio, 1 Bath \n816 W. Waveland \nAvailable: Now \n$1170 per Month \nNaji *** \nDynamite Lakeview studio features heat and cooking gas included, updated kitchen, newer bathroom, bright and sunny windows, awesome closet space, hardwood floors th ...", "Bright 3 Bedroom 1 Bath Single Family Home on large lot Norridge \n4052 N Odell, Norridge IL 60706 \nDETAILS: FiveStarRealtyServices.com \nFive Star Realty Services \nBright 3 Bedroom 1 Bath home on a large lot. Rehabbed Kitchen with Side By side fridge, ...", "Decent 3 Bedroom Apartment on East Side. This is a 2nd floor Unit located at 8456 S. Burnham, Hardwood Floors, Ceramic Tile in the Kitchen &amp; Bath, Large Pantry. Too Much to list here! Call Mr. Griffin for immediate viewing at ***. Section 8 welco ...", "Rehabbed COZY 2 BEDROOM APARTMENT - Blue Line 2 Blocks \nAddress: 3552 W. Belmont Ave #1R, Chicago IL 60618 Avondale \nYou're going to love living in this newly rehabbed cozy 2 bedroom apartment with an eat-in Kitchen. New granite counters and cappucci ...", "Logan Square \n3 Bed, 1 Bath \n2925 W. Diversey \nAvailable: Now \n$1900 per Month \nNaji *** \nSweet three bedroom, one bathroom in hot Logan Square features rehabbed eat in kitchen with espresso cabinets, quartz countertops, stainless steel appliances, d ...", "This amazing luxury apartment building, located in the heart of the South Loop, just steps away from restaurants, shopping, museums, public transportation, parks and Lake Michigan. Take advantage of this extremely unique concrete loft style 1bed apar ...", "Central Park East Apartment Details: 16222 \nBeds: 2 Baths: 2 Sq. Ft.: 1054 Rent: $1695 Floorplan: Two Bedroom, Two Bath (C) * Rent will vary based on lease term and move-in date * RECEIVE $500 OFF TOWARDS YOUR FIRST MONTH'S RENT ON C floorplan on the ...", "4537 N Paulina Unit#1B \nBeautiful 2 bedroom apartment is located in a vintage courtyard building. 3 blocks from Brown line train Montrose stop. \n-Two Bedrooms \n-Large living room \n-Kitchen \n-Ceiling fans \n-Window blinds \n-Hardwood floors \n-Closet spa ...", "Beautiful apartment located in Ravenswood. Two blocks away from the Brownline CTA Train. \nPhysical viewing is available. Please contact Leana *** \n-Bedroom \n- Living room \n-Heat in Kitchen \n-Hardwood floors \n-Laundry in the building \n-Ceiling fans \n- ...", "6259 N Lakewood Unit #G \nGarden apartment \nTwo blocks to Loyola University in desirable Edgewater Glen. \nLakeshore Drive is just a few short blocks away \nPARKING AVAILABLE \n-Large sunny 1 bedroom \n-Living room \n-Kitchen \n-Bathroom \n-New window with b ...", "PROPERTY INFO \nID: 229234946 Rent: $2,500 / Month Beds: 3 Bath: 1.5 Available Date: 07/20/2020 Pet: Cats Only Rent Includes:: Water \nTHIS MASSIVE THREE BED 1.5 BATH 1ST FLOOR WALK UP ON A BEAUTIFUL TREE LINED STREET IS AVAILABLE NOW. TENANTS PAY GAS, ...", "Welcome to Renew Five Ninety Five the exclusive apartment complex in Downtown Des Plaines, Illinois. \n*We are now offering on-site tours by appointment only with certain restrictions in place. Contact our leasing office to set up a time to view an ap ...", "1930 W Montrose Unit #3 \n-Large beautiful unit located Raveswood \n-Walking 1.5 blocks distance to the Brown Line train \"Montrose\" stop. \n-Close to excellent neighborhood dining, Starbucks, trendy boutiques and shops. \n-Living room \n-3 bedrooms \n-Kitc ...", "4533 N Paulina Unit #3A \nBeautiful apartment is located in a beautiful vintage courtyard building in the heart of sought after Ravenswood. \nClose to convenient public transportation only three blocks to the Brown Line el train Montrose stop, three bl ...", "2814 North Troy Street, Chicago, IL Great 1 bedroom 1 bath available! Get the 9th month for free (or take $423 off the rent the last 4 months of the lease) This unit features a large living space, central air, and a luxurious kitchen equipped with st ...", "PROPERTY INFO \nID: 229890724 Rent: $1,100 / Month Beds: 1 Bath: 1 Available Date: 08/01/2020 Pet: Pet Friendly Rent Includes:: Water, Heat \n- Heat, trash, and water are included \n- Laundry on-site \n- Hardwood Floors throughout \n- Pet-friendly up to 2 ...", "Location: 2134 S Goebbert Rd - Arlington Heights, IL 60005 Rental Information: $1115 - $1429/Month | 2 Bedroom 1 Bath | 848 sq ft Lease Terms: 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15- ..."]