["-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "ID: 127273606 \nLocation: West Eastwood, Chicago (Ravenswood) \nRent: $1210 / Month \nAvailable Date: 12/01/2018 \nBeds: 1 \nBaths: 1 \nPet: Pet Friendly \nRent Includes: Heat, Hot Water \nFeatures \nMove-In Fee: $300 \nno security deposit \nApplication fee: $6 ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "Just steps from the Red Line and Loyola University Chicago, this property brings the luxury and convenience of city life to one of Chicago's most vibrant and diverse neighborhoods - Rogers Park. These units offer convenience to public transportation, ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "-Beautiful new condo conversion available NOW! \n-Excellent location in a very nice neighborhood \n-Two new full bathrooms, new huge kitchen, new plumbing and electric. New hardwood floors throughout. \n-Completely renovated bathrooms have all new fixtu ...", "Spacious open floor plan with beautifull kitchen,luxury bathrooms. \nMinutes walk to shopping ,dinning and entertaiment. \nThe best of everything in one place.", "Woodbury Place Apartments offers all newly renovated large floor plans featuring granite countertops, black whirlpool appliances, built-in microwave and oversized patios or balconies. \n-Granite countertops &amp; designer backsplash \n-Near shopping, r ...", "Chestnut Tower embodies the zenith of fantastic high-rise apartment living in the desirable Downtown Chicago area. Our luxury Downtown Chicago, IL apartments beautifully blend urban life with neighborhood warmth. Possessing an amazing location where  ...", "1Bedroom \n1 Bath \nONLY PAY ELECTRIC - HEAT INCLUDED \nLaundry in Building \nClose to Schools and Train \nGood Credit Please \nCall *** \n6844 W 111th Place \nWorth, IL 60482", "THIS IS A LEASE/OPTION, RENT TO OWN HOME. \nWant to own your own home, but can't get a home loan or bank qualification, due to damaged credit or \nself employment? This gorgeous home could be yours without bank qualifying! You are qualified based \non i ...", "Right in-between Andersonville and Edgewater  apartment you've been waiting for. Brand new, gut rehab, with gorgeous finishes. The Details: :: In-unit Laundry :: Marble Countertops :: Herringbone Tile Backsplash :: Hardwood Floors :: Stainless Stee ...", "Must see, recently constructed, and located in Edgewater! Footsteps away from both public transportation, Loyola, and the lake. Just a extraordinary apartment! This apartment features hardwood floors, granite countertops, modern fixtures &amp; lighti ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Rent To Own your own home Today. RENT IT &gt; LOVE IT &gt; BUY IT! \nThe pictures speak for themselves. This 4 bedroom, 2 full bath 1,469 sqft home is gorgeous, HU ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Can't get a mortgage? Are you in need of a second chance at home ownership due to \nCredit Issues, Bankruptcy, Short Sale, Divorce? We believe in second chances. R ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Rent To Own your own home Today. RENT IT &gt; LOVE IT &gt; BUY IT! \nAre you moving out from the city but still need to get to the city? This beautiful split-level ...", "THIS IS A LEASE/OPTION, RENT TO OWN HOME. \nWant to own your own home, but can't get a home loan or bank qualification, due to damaged credit or self employment? This gorgeous home could be yours without bank qualifying! You are qualified based on inc ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Can't get a mortgage? Are you in need of a second chance at home ownership due to Credit Issues, Bankruptcy, Short Sale, Divorce? We believe in second chances. Re ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Rent To Own your own home Today. RENT IT &gt; LOVE IT &gt; BUY IT! \nAre you moving out from the city but still need to get to the city? This beautiful 2,309 squar ...", "Built in 2018. Maintenance on site, 24/7 concierge and security system. This gorgeous two-tower community in the River West neighborhood features units and town homes with instant access to the heart of the city via the Blue Line and Milwaukee Avenue ...", "NOTE: This house is only available for lease purchase / rent to own. \nTired Of Renting? Can't get a mortgage? Are you in need of a second chance at home ownership due to Credit Issues, Bankruptcy, Short Sale, Divorce? We believe in second chances. Re ...", "THIS IS A LEASE/OPTION, RENT TO OWN HOME. \nWant to own your own home, but can't get a home loan or bank qualification, due to damaged credit or self employment? This gorgeous home could be yours without bank qualifying! You are qualified based on inc ...", "Better than a Hotel . . . \nThis property is available if you need to stay in the area short term. It is priced at $100 per day and it is fully furnished and stocked with all your daily essentials . . . all you have to do is bring yourself. \nIt is gre ...", "Live in the best neighborhood! | PID No.: 1274 | fgr1 #sangu \nUNIT AMENITIES - - - A/C | CENTRAL AIR | CONCIERGE | DECK | DINING ROOM | DISHWASHER | DISPOSAL | DOORMAN | EAT-IN KITCHEN | ELEVATOR | FITNESS CENTER | HARDWOOD FLOORS | HIGH CEILING | IN ...", "River North highrise stuns with chicly modern kitchens and bathrooms and spacious walk-ins. Cat-friendly and fitness-forward, the apartments reflect the energy of the city with their 24-hour fitness center. Relax by the outdoor pool while soaking up  ...", "Forest Cove Apartments offer oversized floor plans that feature private balconies or patios, raised entryways, separate dining rooms, gourmet kitchens with all new appliances, abundant closet space and designer paint finishes. \n-New appliances \n-Priv ...", "This is a MUST SEE! Brand new, gut rehabbed 2 bed / 2 and a half bath apartment that is absolutely gorgeous!  The pictures tell the story on this unit; spacious floor plans with condo quality finishes and high-end kitchen appliances that you won ...", "Breathtaking views, and every amenity you can ask for! W/D in unit! | PID No.: 1256 | fgr1 #sangu \nBUILDING AMENITIES: DOORMAN, A/C, CENTRAL AIR, DECK, DINING ROOM, HARDWOOD FLOORS, HIGH CEILING, ROOF DECK, STORAGE, WALK-IN CLOSET, LAUNDRY IN UNIT, D ...", "River North highrise stuns with chicly modern kitchens and bathrooms and spacious walk-ins. Cat-friendly and fitness-forward, the apartments reflect the energy of the city with their 24-hour fitness center. Relax by the outdoor pool while soaking up  ...", "ID: 71482214 \nRent: $2643 / Month \nAvailable Date: NOW \nBeds: 2 \nBaths: 2 \nPet: Pet Friendly \nFeatures: Laundry in Unit \nAmazing find!! \nFirst Class all brand new, high end highrise in South Loop \n2 Months Free on 15-18 Month Leases. Deal is included ...", "**SPECIAL: 2 MONTHS RENT FREE W/OUT BROKER !!** \nLocated on a quiet residential street, this spacious, renovated one bedroom offers vintage styling, large closet, carpet floors, on site laundry, elevator service and FREE HEAT and Cooking Gas INCLUDED ...", "What once was a hotel is now a converted luxury boutique residence. Find everything from hardwood floors to granite counter tops at this Gold Coast gem. Be minutes away from Mag Mile while far enough from all of the congestion. | PID No.: 1292 \n✨ C ...", "Great Studio apartment at a great price! Call / text with any questions and to set up a showing. Apartments feature: :: In Unit Laundry :: Granite Counter Tops :: Custom Cabinetry :: Tile Backsplash's :: Glass Enclosed Rain Shower Building Features:  ...", "GMD Systems welcomes you to come to view a very spacious and gorgeous artsy 1.5 Bedroom, 1 Bathroom apartment that is available for rent. Beautiful high ceilings in den with great heating! \n::::::::::::::::::AVAILABLE APARTMENTS:::::::::::::::::: \n1. ...", "Spacious 1 bedroom apartment with great natural light nestled on a tree lined street.  Located within walking distance to Lake Michigan beaches, shopping, dining, and public transit (both EL and bus lines).\nFeatures: \n:: In-Unit Washer &amp; Dryer \n ...", "GMD Systems welcomes you to come to view a very spacious and gorgeous artsy 2 Bedroom, 1 Bathroom apartment that is available for rent. \n::::::::::::::::::AVAILABLE APARTMENTS:::::::::::::::::: \n2 Bdrm, 1 Bth - 850 Sq.Ft., Living Room, Hallway, Kitch ...", "Kedvale Systems welcomes you to view very Spacious, Stylish, and Gorgeous Fully Furnished Apartments that are available for rent. \n**FURNISHED Apartments** include: \n.........................Furnishings............................. \nLiving Room - Liv ...", "With modern finishes, in-unit laundry, hardwood floors, and a separate den area...you need to see this apartment. You'll be hard pressed to find a better looking 2 bedroom in the area at this price. Call, text, or email today with any questions or t ...", "Right in-between Andersonville and Edgewater  apartment you've been waiting for. Brand new, gut rehab, with gorgeous finishes. The Details: :: In-unit Laundry :: Marble Countertops :: Herringbone Tile Backsplash :: Hardwood Floors :: Stainless Stee ...", "A BRAND NEW REHABBED APARTMENT LOCATED STEPS TO CTA RED LINE STOP***4 BLOCKS AWAY FROM THE LAKEFRONT AND BEACH***THIS UNIT FEATURES HARDWOOD FLOORS THROUGHOUT 42\" KITCHEN CABINETS WITH GRANITE COUNTERTOPS***STAINLESS STEEL APPLIANCES*** LAUNDRY AND J ...", "This isn't your usual Chicago apartment rental. Offering luxury amenities that are unparalleled among Chicago high rise units, this apartment community is a fully-loaded, everything-you-ever-dreamed-of palace cleverly disguised as a Chicago high rise ...", "With the lake, public transit, bars, restaurants, shopping, nightlife, and more all just right outside the front door, you'll love this Lincoln Park apartment! This newly rehabbed apartment features custom cabinetry, quartz countertops with tile back ...", "Call or text me for an ASAP response. Features: :: Easy CTA Access :: Walk to Michigan Ave. :: Walk to Northwestern :: Spacious Floor Plans :: Great City &amp; Lake Views COMMUNITY AMENITIES :: 24-Hour Door Attendant :: 360 Degree Sun Deck :: Skyline ...", "Brand new construction condo quality apartments available September 1 until November of 2018. Call or email us for more information! \nCall | *** \nEmail | VistaCL[at]ChicagoRealEstate.io \n1 Beds / 1.5 Baths up to 1,000 Sq Ft Starting at $2,100 \n2 Beds ...", "Brand new construction condo quality apartments available September 1 until November of 2018. Call or email us for more information! \nCall | *** \nEmail | VistaCL[at]ChicagoRealEstate.io \n1 Beds / 1.5 Baths up to 1,000 Sq Ft Starting at $2,100 \n2 Beds ...", "NEW REHABBED APARTMENT LOCATED STEPS TO CTA RED LINE STOP***4 BLOCKS AWAY FROM THE LAKEFRONT AND BEACH***THIS UNIT FEATURES HARDWOOD FLOORS THROUGHOUT 42\" KITCHEN CABINETS WITH GRANITE COUNTERTOPS***STAINLESS STEEL APPLIANCES*** LAUNDRY AND JANITOR O ...", "Whether you are a graduate student at Midwestern University or an \nintern at Groupon in Downtown Chicago, the suburban beauty of \nLombard in Illinois is your retreat. Located 20 miles from Chicago \nin a private neighborhood in Du Page County, we are  ...", "Must see, recently constructed, and located in Edgewater! Close away from both public transportation, Loyola, and the lake. All apartment homes feature hardwood floors, granite countertops, modern fixtures &amp; lighting, rain showers, and in-unit la ...", "What once was a hotel is now a converted luxury boutique residence. Find everything from hardwood floors to granite counter tops at this Gold Coast gem. Be minutes away from Mag Mile while far enough from all of the congestion. | PID No.: 1294 \n✨ C ...", "Stunning views, and gorgeous amenity areas. Call to schedule an appointment now! | PID No.: 1184 \nUnit Amenities \nDoorman, A/C, Central Air, Deck, Dining Room, Hardwood Floors, High Ceiling, Roof Deck, Storage, Walk-In Closet, Laundry in Unit, Dishwa ...", "Currently offering 1 month free! Rate reflected includes 1 month free. \nRent: $1640 on a 12 month lease \nW/D in unit, dishwasher \nAttached garage parking available for fee \nConvertible apartment with a spacious floor plan and floor to ceiling windows ...", "Currently offering 1 month free! (Rate posted reflects concession, market rent is $2799) \nRent: $2569 on a 12 month lease \nW/D in unit, dishwasher \nAttached garage parking available for fee \nTwo bedroom apartment with a spacious floor plan and floor  ...", "Currently offering 1 month free! (Rate posted reflects concession, market rent is $2060) \nRent: $1899 on a 12 month lease \nW/D in unit, dishwasher \nAttached garage parking available for fee \nOne bedroom apartment with a spacious floor plan and floor  ...", "This building intersects at Everything St. and Everywhere Ave. in the heart of Chicago. \nImagine relaxing in an expansive living space, overlooking the gorgeous city views, preparing meals for one, two, or many in the kitchen with plenty of granite c ...", "Huge studio just a few steps from the lake front. Heat/Gas and water are included in rent. Lots of extra closet space. Available September 1st. Contemporary Mid-Rise building located in the heart of vibrant &amp; trendy East Lakeview just steps from  ...", "No expense was spared when designing and constructing this apartent. Originally built as a developers custom home, this high end unit is now available for rent. Two of the bedrroms feature spa like in-suite bathrooms complete with seperate soaking tu ...", "Beautiful 3 bedroom 2 bathroom duplex apartment. Large master suite. Walk-in closets. Huge living area with wood burning fireplace. Newer kitchen with dishwasher. Short walk to the Red Line Train.Hardwood throughout the 1st floor ,carpet on the 2nd.N ...", "Great 2 bed 1 bath in the heart of Bucktown. Bonus office off one bedroom.Unit has central a/c and heat. Cats are allowed but no dogs. Bright kitchen with good cabinet space. Older building bedrooms are on the smaller size.Close proximity to the 606, ...", "Brand New Construction, 2 bedroom/2 bathroom apartment in the heart of LakeView! Elevator building. High ceilings. Kitchens feature quartz counters, tile back splash, and stainless appliances. All apartments have a private balcony, central heat/ac an ...", "Right in-between Andersonville and Edgewater  apartment you've been waiting for. Brand new, gut rehab, with gorgeous finishes. The Details: :: In-unit Laundry :: Marble Countertops :: Herringbone Tile Backsplash :: Hardwood Floors :: Stainless Stee ...", "Stunning 2 bedroom 2 bathroom apartment. Huge living room. Wood burning fireplaces. Laundry room is In-Unit. Granite counter-tops in kitchen. One outdoor parking space available for a fee. . Beautiful brick 4 flat walk up. Short distance to the Lake, ...", "Brand new construction condo quality apartments available September 1 until November of 2018. Call or email us for more information! \nCall | *** \nEmail | VistaCL[at]ChicagoRealEstate.io \n1 Beds / 1.5 Baths up to 1,000 Sq Ft Starting at $2,100 \n2 Beds ...", "Super cute 2 bed 1 bath in the heart of Bucktown. Hardwood floors . Central heat but will need a window unit for a/c. Close to 606 , Western Blue line, Clybourn Metra stop and tons of restaurants and shopping. Cats allowed but no dogs.One month secur ...", "Beautiful 2 BR 2 Full Bath Unit has living room w/gas fireplace. The eat in kitchen opens up to a large enclosed sun porch. The kitchen has newer appliances including a dish washer. Full size washer and dryer. Tandem parking space included in rent! A ...", "The Atworth at Mellody Farm is a place where opposing elements balance harmoniously - rustic and modern, energy and tranquility, simplicity and luxury. Find the perfect fit for your lifestyle within our luxury studio, one, two and three bedroom apart ...", "Beautiful 2 bed 1 bath , 1st floor corner unit . Hardwood floors throughout. Central a/c and heat. Newly remodeled kitchen and bathroom. Huge deck off the kitchen. Easy street parking. Close to Brown line, Jewel, Welles park, and Aldi. Cats are allow ...", "Apartments feature: Huge custom closets, wide-plank flooring throughout (including bedrooms), quartz countertops, in-unit washer/dryer, roller shade window treatments, energy-efficient stainless appliances", "Newly remodeled property located in a prime Lakeview location.  With the lake, public transit, bars, restaurants, shopping, nightlife, and more all just right outside the front door, you'll love this location! This newly rehabbed apartment features  ...", "Large Vintage 3 Bed / 2 Bath, built-in hutches, exposed beams, bay windows, formal dining room, large back-porch. Central a/c and heat . Cats allowed but no dogs. Laundry in building. Close proximity to Sheridan Red line, Jewel , Aldi and Target. One ...", "The Woodlands\nhttp://woodlandsofcresthill.com/su/ydbf \nCome visit The Woodlands of Crest Hill where we are under new management!- Smoke Free buildings available!- Se Habla Espanol \nFloor Plan: Cypress \nSq Feet: \n598\nRent: \n$876+ *Prices and availabil ...", "$1,115/M (Heat included) \n5 Months Sublet \n1Block from Clark/Division RedLine \nFurnished +$300 (Buyout all Furnitures)", "Brand new construction condo quality apartments available September 1 until November of 2018. Call or email us for more information! \nCall | *** \nEmail | VistaCL[at]ChicagoRealEstate.io \n1 Beds / 1.5 Baths up to 1,000 Sq Ft Starting at $2,100 \n2 Beds ...", "ID: 9049471 \nRent: $1610 / Month \nAvailable Date: - \nBeds: 1 \nBaths: 1 \nPet: Cat Ok \nFeatures: Balcony-All Units, Balcony-All Units, Central Air-Yes, Central Air-Yes, Dishwasher-All, Dishwasher-All, Flooring-Carpet Only, Flooring-Carpet Only, Laundry ...", "UNIT AMENITIES : A/C | CENTRAL AIR | CONCIERGE | DECK | DINING ROOM | DISHWASHER | DISPOSAL | DOORMAN | EAT-IN KITCHEN | ELEVATOR | FITNESS CENTER | HARDWOOD FLOORS | HIGH CEILING | INTERNET | LAUNDRY IN UNIT | MICROWAVE | MODERN KITCHEN | NEW APPLIA ...", "The Woodlands\nhttp://woodlandsofcresthill.com/su/ydbf \nCome visit The Woodlands of Crest Hill where we are under new management!- Smoke Free buildings available!- Se Habla Espanol \nFloor Plan: Cypress \nSq Feet: \n598\nRent: \n$863+ *Prices and availabil ...", "Residents of AMLI's Deerfield apts will enjoy outstanding amenities including a scenic courtyard with resort-style pool, outdoor fireplace and barbecue grills; state-of-the-art fitness center with a separate yoga and Pilates studio; expansive residen ...", "Second floor in two flat with yard has garden, porch deck area, garage available, laundry in basement, walk to restaurants, 5 blocks to blue line!", "Brand new construction condo quality apartments available September 1 until November of 2018. Call or email us for more information! \nCall | *** \nEmail | VistaCL[at]ChicagoRealEstate.io \n1 Beds / 1.5 Baths up to 1,000 Sq Ft Starting at $2,100 \n2 Beds ...", "ID: 46538983 \nLocation: West Division, Chicago (Old Town) \nRent: $1879 / Month \nAvailable Date: - \nBeds: 1 \nBaths: 1 \nPet: Pet Friendly \nFeatures: Balcony-None, Balcony-None, Central Air-Yes, Central Air-Yes, Dishwasher-All, Dishwasher-All, Dogs-No W ...", "Total gut rehab located in prime Edgewater location! Spacious floorplans, good views, and sought after finishes, all in a convenient spot.  You owe it to yourself to check out this property. Just a SPLENDID apartment. The Details: Stainless Steel Ap ...", "ID: 70482204 \nRent: $1644 / Month \nAvailable Date: - \nBeds: 1 \nBaths: 1 \nPet: Pet Friendly \nFeatures: Balcony-Some Units, Balcony-Some Units, Central Air-Yes, Central Air-Yes, Dishwasher-All, Dishwasher-All, Dogs-No Weight Limit, Dogs-No Weight Limit ...", "-Handyman Service \n-Satisfaction Guaranteed Program \n-Scenic Lake with Walking Path \n-24-Hour Fitness Centre \n-Vacation Pet Care &amp; Dog Walking Service \n-Resort Style Heated Swimming Pool \n-Planned Social Activities \n-24-Hour, 7-Day Package Pick-U ...", "ID: 70482204 \nRent: $1644 / Month \nAvailable Date: - \nBeds: 1 \nBaths: 1 \nPet: Pet Friendly \nFeatures: Balcony-Some Units, Balcony-Some Units, Central Air-Yes, Central Air-Yes, Dishwasher-All, Dishwasher-All, Dogs-No Weight Limit, Dogs-No Weight Limit ...", "Competitively priced full amenity building! | PID No.: 1190 \nUnit Amenities \nDoorman, A/C, Central Air, Deck, Dining Room, Hardwood Floors, High Ceiling, Roof Deck, Storage, Walk-In Closet, Laundry in Building, Dishwasher, Disposal, Eat-in Kitchen, M ...", "Great 1 BEDROOM apartment at a great price! Call / text with any questions and to set up a showing. Apartments feature: :: In Unit Laundry :: Granite Counter Tops :: Custom Cabinetry :: Tile Backsplash's :: Glass Enclosed Rain Shower :: Free Wi-FI  ...", "GREAT LAYOUTS USING EVERY SQUARE INCH TO THE FULLEST! | PID NO.: 1246 \nUNIT AMENITIES \nA/C | CENTRAL AIR | CONCIERGE | DECK | DINING ROOM | DISHWASHER | DISPOSAL | DOORMAN | EAT-IN KITCHEN | ELEVATOR | FITNESS CENTER | HARDWOOD FLOORS | HIGH CEILING  ...", "Call today to see this 3 BED / 2 Bath Duplex with W/D In-unit, located in the heart of Lakeview. Nestled between Broadway &amp; Halsted, you'll be steps from restaurants, bars, shopping, the lake and more! Easy access to the EL &amp; multiple bus ro ...", "Competitively priced full amenity building! | PID No.: 1188 \nUnit Amenities \nDoorman, A/C, Central Air, Deck, Dining Room, Hardwood Floors, High Ceiling, Roof Deck, Storage, Walk-In Closet, Laundry in Building, Dishwasher, Disposal, Eat-in Kitchen, M ...", "Live in the best neighborhood! | PID No.: 1272 | fgr1 #sangu \nUNIT AMENITIES - - A/C | CENTRAL AIR | CONCIERGE | DECK | DINING ROOM | DISHWASHER | DISPOSAL | DOORMAN | EAT-IN KITCHEN | ELEVATOR | FITNESS CENTER | HARDWOOD FLOORS | HIGH CEILING | INTE ...", "ID: 33784263 \nLocation: Hinman, Evanston \nRent: $1495 / Month \nAvailable Date: NOW \nBeds: 2 \nBaths: 1 \nPet: Pet Friendly \nRent Includes: Heat, Hot Water \nFeatures \nApplication fee: $60 per adult \nMove-In Fee: $400 \nno security deposit \nHeat: Included ...", "River North highrise stuns with chicly modern kitchens and bathrooms and spacious walk-ins. Cat-friendly and fitness-forward, the apartments reflect the energy of the city with their 24-hour fitness center. Relax by the outdoor pool while soaking up  ...", "Prime Gold Coast convertible at 1030 N State is now available. With an open floor plan, updated kitchen, stainless steel appliances, and washer dryer in unit- this apartment truly is one of a kind. Boasting some of the most stunning views from the Go ...", "ID: 71482215 \nRent: $2011 / Month \nAvailable Date: NOW \nBeds: 1 \nBaths: 1 \nPet: Pet Friendly \nFeatures: Laundry in Unit, Parking For Rent \nAmazing new offer !!! \n2 Months Free on 15-18 Month Leases. Deal is included in price shown \nFirst Class all br ...", "Live in Logan Square's most luxurious building. You can be steps away from the California Blue Line while having the convenience of a mid rise building. Everything is built in the building is for your convenience. Expect sleek lines and upgraded unit ...", "Live in the best neighborhood! In the heart of Gold Coast! | PID No.: 1275 | fgr1 #sangu \nUNIT AMENITIES - - - A/C | CENTRAL AIR | CONCIERGE | DECK | DINING ROOM | DISHWASHER | DISPOSAL | DOORMAN | EAT-IN KITCHEN | ELEVATOR | FITNESS CENTER | HARDWOO ...", "Large 3bdrm with living rm, dining rm and family rm, one bath. This is the 2nd/3rd floor of a well maintained 115 yr old house in central Oak Park. 2 blocks to Oak park green line station and downtown OP. Walk to many restaurants/shops. 5 blocks to O ...", "The Woodlands\nhttp://woodlandsofcresthill.com/su/ydbf Come visit The Woodlands of Crest Hill where we are under new management!- Smoke Free buildings available!\n- Se Habla Espanol \nFloor Plan: Maple \nSq Feet: \n816\nRent: \n$1197+ * Prices and availabil ..."]